Dlubal.RFEM5.ErrorType
Type of error

Dlubal.RFEM5.ErrorType.UnknownErrorType
Unknown error

Dlubal.RFEM5.ErrorType.UserErrorType
User error

Dlubal.RFEM5.ErrorType.InternalErrorType
Internal error

Dlubal.RFEM5.ErrorType.WarningType
Warning

Dlubal.RFEM5.ErrorType.CalculationErrorType
Calculation error